icofoam-cases/thermalChannel2D/TestCase-01/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

Tin             300;
Tw              350;

internalField   uniform   $Tin;

boundaryField
{
    inlet
    {
        type    fixedValue;
        value   uniform   $Tin;
    }

    outlet
    {
	type    zeroGradient;  
    }

    walls
    {
        type     fixedValue;
        value    uniform   $Tw;
    }

    frontAndBack
    {
        type    empty;
    }
}

// ************************************************************************* //
