icofoam-cases/thermalChannel2D/TestCase-01/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xrat    0.5;
ixrat   #calc "1.0/$xrat"; 
rat     0.25;
irat    #calc "1.0/$rat";

vertices
(
    ( 0.0  0.0   0.0 )
    ( 0.4  0.0   0.0 )
    ( 0.4  0.02  0.0 )
    ( 0.0  0.02  0.0 )

    ( 0.0  0.0   0.01 )
    ( 0.4  0.0   0.01 )
    ( 0.4  0.02  0.01 )
    ( 0.0  0.02  0.01 )
);

blocks
(
   //hex (0 1 2 3 4 5 6 7) (200 10 1) simpleGrading (1 1 1)
   hex (0 1 2 3 4 5 6 7) 
   (200 10 1) 
   simpleGrading 
   (
      $ixrat ( (0.5 1 $irat) (0.5 1 $rat) ) 1 
   )
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (0 1 5 4)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
